In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv("salary.csv")
data.head()

  qualification  experience  noofsubjects  position  salary
0         btech           1             2  lecturer   25000
1         btech           2             1  lecturer   25000
2         btech           3             2  lecturer   30000
3         btech           4             3  lecturer   32000
4         btech           5             2  lecturer   35000

In [3]:
from sklearn.preprocessing import LabelEncoder
lab=LabelEncoder()
data["qualification"]=lab.fit_transform(data["qualification"])
data["position"]=lab.fit_transform(data["position"])

In [4]:
x=data.iloc[:,:-1]
y=data.iloc[:,-1]

In [11]:
from sklearn.linear_model import LinearRegression
model=LinearRegression(n_jobs=-1,)
model.fit(x,y)

LinearRegression(n_jobs=-1)

In [12]:
data

     qualification  experience  noofsubjects  position  salary
0                0           1             2         3   25000
1                0           2             1         3   25000
2                0           3             2         3   30000
3                0           4             3         3   32000
4                0           5             2         3   35000
..             ...         ...           ...       ...     ...
103              2           6             1         1   70000
104              2           7             3         1   75000
105              2           8             3         1   80000
106              2           9             4         1   90000
107              2          10             4         1   91000

[108 rows x 5 columns]

In [13]:
model.predict([[0,5,2,1]])

C:\Users\gowtham\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([42296.76603387])

In [14]:
data["qualification"].value_counts()

1    39
0    38
2    31
Name: qualification, dtype: int64

In [15]:
data["position"].value_counts()

1    31
0    30
2    19
3    18
4    10
Name: position, dtype: int64

In [16]:
model.score(x,y)

0.8356859495759295